spring-ws-core/src/test/resources/org/springframework/ws/transport/http/soapRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'>
    <SOAP-ENV:Body>
        <m:GetLastTradePrice xmlns:m='https://www.springframework.org/spring-ws'>
            <symbol>DIS</symbol>
        </m:GetLastTradePrice>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>